[
    {
        "Title": "Technology Support Specialist",
        "Company": "ACL Digital",
        "Description": "Technical expertise in various facets of PC support, which may include PC applications, hardware, tools, utilities, networking, telecommunications.",
        "Salary": "$25 - $32 an hour"
    },
    {
        "Title": "Reporting & Data Analytics Analyst - Multiple Locations",
        "Company": "U.S. Bank",
        "Description": "The EPD team consists of both the Elan Advisory Services (EAS) team and the Elan Credit Card (ECC) team.\nEAS provides solutions such as end-to-end agent credit...",
        "Salary": "$78,200 - $92,000 a year"
    },
    {
        "Title": "IT Audit Analyst - Hybrid",
        "Company": "MUFG",
        "Description": "The IT Audit Analyst role within the Internal Audit function is responsible for supporting independent, objective assurance and consulting activities designed...",
        "Salary": "None"
    },
    {
        "Title": "Financial Services Data/BI Analyst",
        "Company": "Broadtree Partners LLC",
        "Description": "The data analyst will help accelerate Broadtree's proprietary deal flow and will work on both new acquisition opportunities as well as portfolio company add-on...",
        "Salary": "$52,000 - $80,000 a year"
    },
    {
        "Title": "Information Security Normalization Analyst",
        "Company": "Vanguard",
        "Description": "Our teams leverage enterprise-wide insights, deep expertise, and trusted advice so that across Vanguard leaders and crew drive faster, stronger, risk-informed...",
        "Salary": "None"
    },
    {
        "Title": "Audit Associate | Charlotte Summer/Fall 2022",
        "Company": "KPMG",
        "Description": "Coursework or minor in information systems, software engineering, computer science or data and analytics preferred; experience with data analysis tools and...",
        "Salary": "None"
    },
    {
        "Title": "Staff Software Engineer (Charlotte, NC)",
        "Company": "The Hartford",
        "Description": "Provide technical leadership, enforcing the vision of the application architecture and integrity of the application environment in alliance with architects and...",
        "Salary": "None"
    },
    {
        "Title": "Quality Assurance Specialist",
        "Company": "Foxquilt",
        "Description": "Foxquilt develops, underwrites and distributes a complete line of its own commercial insurance products in the United States and Canada.",
        "Salary": "None"
    },
    {
        "Title": "Fellow - Cloud Data Architect",
        "Company": "Full Cycle Services",
        "Description": "The Cloud Architect is responsible for architecting developing and maintaining the Enterprise Data Platform including a Serverless Data Lake, Cloud Data...",
        "Salary": "$175,000 - $210,000 a year"
    },
    {
        "Title": "IT Support Service Desk Student Employee",
        "Company": "Electric Power Research Institute",
        "Description": "Responds to inquiries and requests from users for assistance with EPRI workstations, mobile devices, printers and processes.",
        "Salary": "None"
    },
    {
        "Title": "Software Engineer - Int Software Engineer - Remote",
        "Company": "Publix",
        "Description": "Publix Technology associates enjoy the ability to own Publix stock, work-from-home potential, highly competitive pay, health insurance and other benefits.",
        "Salary": "$81,640 - $133,445 a year"
    },
    {
        "Title": "Backend Developer",
        "Company": "Piper Companies",
        "Description": "Keywords: backend, developer, backend developer, data, science, firm, analytic, consulting, firm, clients, technology, predictive modeling, data mining,...",
        "Salary": "$85,000 - $95,000 a year"
    },
    {
        "Title": "Data Scientist Associate",
        "Company": "Novant Health",
        "Description": "Additional Skills Preferred: Experience with advanced computer science and analysis techniques such as graph theory, machine learning, natural language...",
        "Salary": "None"
    },
    {
        "Title": "Sr. Java Developer",
        "Company": "Exponentlogic Solution",
        "Description": "We are looking for a Senior Java Developer to manage the software development life cycle, from planning and prioritizing to testing and release.",
        "Salary": "$60 - $70 an hour"
    },
    {
        "Title": "Associate Software Engineer",
        "Company": "Moody's",
        "Description": "Contribute to ongoing feature development of web applications based on service-oriented architecture, involving UI, Services and databases.",
        "Salary": "None"
    }
]